Revit 2026 API

# SiteLocationIsCompatibleWith Method

---

Checks whether the geographic coordinate system of this site is compatible with the given site . True if he geographic coordinate system of this site is compatible with the given site, false otherwise.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsCompatibleWith(
	SiteLocation otherSiteLocation
)
```
```vb
Public Function IsCompatibleWith (
	otherSiteLocation As SiteLocation
) As Boolean
```
```cpp
public:
bool IsCompatibleWith(
	SiteLocation^ otherSiteLocation
)
```
```fsharp
member IsCompatibleWith :
        otherSiteLocation : SiteLocation -> bool
```

#### Parameters

otherSiteLocation SiteLocation

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SiteLocation Class

Autodesk.Revit.DB Namespace